glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/ssd1306.c
/// SSD1306 driver

#include <stdlib.h>
#include <string.h>

#include "stm32f4xx.h"

#include "proxmark3.h"
#include "hw_config.h"
#include "l1_board.h"

#define GDISP_SCREEN_HEIGHT     (64)
#define GDISP_SCREEN_WIDTH      (128)

#define SCREEN_WIDTH            GDISP_SCREEN_WIDTH
#define SCREEN_HEIGHT           GDISP_SCREEN_HEIGHT

#define m_clip_x_max            GDISP_SCREEN_WIDTH
#define m_clip_y_max            GDISP_SCREEN_HEIGHT
#define m_clip_x_min            0
#define m_clip_y_min            0

#ifndef GDISP_INITIAL_CONTRAST
#define GDISP_INITIAL_CONTRAST  100
#endif
#ifndef GDISP_INITIAL_BACKLIGHT
#define GDISP_INITIAL_BACKLIGHT 100
#endif

#ifdef SSD1306_PAGE_PREFIX
#define SSD1306_PAGE_WIDTH      (GDISP_SCREEN_WIDTH+1)
#define SSD1306_PAGE_OFFSET     1
#else
#define SSD1306_PAGE_WIDTH      GDISP_SCREEN_WIDTH
#define SSD1306_PAGE_OFFSET     0
#endif

#undef BOARD_REVISION

// Buffer for OLED
static unsigned char sVideoRAM[GDISP_SCREEN_HEIGHT/8 * SSD1306_PAGE_WIDTH ];

#define xyaddr(x, y)            (SSD1306_PAGE_OFFSET + (x) + ((y)>>3)*SSD1306_PAGE_WIDTH)
#define xybit(y)                (1<<((y)&7))

#if BOARD_REVISION != 3
// These should be hardware SPI in board 3

#define LCD_SCLK_HIGH()         GPIO_WriteBit(OLED2_PORT,SCLK_DB0_PIN,Bit_SET)
#define LCD_SCLK_LOW()          GPIO_WriteBit(OLED2_PORT,SCLK_DB0_PIN,Bit_RESET)

#define LCD_SDIN_HIGH()         GPIO_WriteBit(OLED2_PORT,SDIN_DB1_PIN,Bit_SET)
#define LCD_SDIN_LOW()          GPIO_WriteBit(OLED2_PORT,SDIN_DB1_PIN,Bit_RESET)

#endif

// Cursor
static unsigned char    u8CursorX, u8CursorY;
static unsigned char    Misc = 0;

#define             NEGATIVE        ( 1 )

// System 3x6 (char #22 to #96)
static const unsigned char Fonts[] = {
	0x30,0x0C,0x02, // long /               // 0x16
	0x38,0x20,0x38, // u                    // 0x17
	0x0A,0x0F,0x02, // up arrow             // 0x18
	0x05,0x0F,0x04, // down arrow           // 0x19
	0x00,0x00,0x38, // first part of m      // 0x1A
	0x18,0x08,0x38, // second part of m     // 0x1B
	0x30,0x0C,0x02, // first part of /div   // 0x1C
	0x28,0x3E,0x00, // second part of /div  // 0x1D
	0x18,0x20,0x18, // third part of /div   // 0x1E
	0x38,0x26,0x38, // delta                // 0x1F
	0x00,0x00,0x00, // Space   // 0x20
	0x00,0x2E,0x00, // !
	0x06,0x00,0x06, // "
	0x3E,0x14,0x3E, // #
	0x14,0x3F,0x0A, // $
	0x12,0x08,0x24, // %
	0x14,0x2A,0x34, // &
	0x00,0x06,0x00, // '
	0x1C,0x22,0x00, // (
	0x22,0x1C,0x00, // )
	0x1C,0x1C,0x1C, // *
	0x08,0x1C,0x08, // +
	0x40,0x20,0x00, // ,
	0x08,0x08,0x08, // -
	0x00,0x20,0x00, // .
	0x10,0x08,0x04, // /
	0x1C,0x22,0x1C, // 0    // 0x30
	0x24,0x3E,0x20, // 1
	0x32,0x2A,0x24, // 2
	0x22,0x2A,0x14, // 3
	0x0E,0x08,0x3E, // 4
	0x2E,0x2A,0x12, // 5
	0x3E,0x2A,0x3A, // 6
	0x02,0x3A,0x06, // 7
	0x3E,0x2A,0x3E, // 8
	0x2E,0x2A,0x3E, // 9
	0x00,0x14,0x00, // :
	0x20,0x14,0x00, // ;
	0x08,0x14,0x22, // <
	0x14,0x14,0x14, // =
	0x22,0x14,0x08, // >
	0x02,0x2A,0x04, // ?
	0x1C,0x26,0x2E, // @    // 0x40
	0x3C,0x0A,0x3C, // A
	0x3E,0x2A,0x14, // B
	0x1C,0x22,0x22, // C
	0x3E,0x22,0x1C, // D
	0x3E,0x2A,0x22, // E
	0x3E,0x0A,0x02, // F
	0x1C,0x22,0x1A, // G
	0x3E,0x08,0x3E, // H
	0x22,0x3E,0x22, // I
	0x10,0x20,0x1E, // J
	0x3E,0x08,0x36, // K
	0x3E,0x20,0x20, // L
	0x3E,0x04,0x3E, // M
	0x3E,0x02,0x3E, // N
	0x3E,0x22,0x3E, // O
	0x3E,0x0A,0x04, // P    // 0x50
	0x1C,0x22,0x3C, // Q
	0x3E,0x0A,0x34, // R
	0x24,0x2A,0x12, // S
	0x02,0x3E,0x02, // T
	0x3E,0x20,0x3E, // U
	0x1E,0x20,0x1E, // V
	0x3E,0x10,0x3E, // W
	0x36,0x08,0x36, // X
	0x0E,0x30,0x0E, // Y
	0x32,0x2A,0x26, // Z
	0x00,0x3E,0x22, // [
	0x04,0x08,0x10, // /*\*/
	0x22,0x3E,0x00, // ]
	0x04,0x02,0x04, // ^
	0x40,0x40,0x40, // _
	0x02,0x04,0x00, // `   // 0x60
	0x34,0x2c,0x38, // a
	0x3e,0x24,0x18, // b
	0x18,0x24,0x24, // c
	0x18,0x24,0x3e, // d
	0x18,0x34,0x2c, // e
	0x08,0x3c,0x0a, // f
	0x58,0x54,0x3c, // g
	0x3e,0x04,0x38, // h
	0x00,0x3a,0x00, // i
	0x40,0x3a,0x00, // j
	0x3e,0x18,0x24, // k
	0x00,0x1e,0x20, // l
	0x3c,0x0c,0x3c, // m
	0x3c,0x04,0x38, // n
	0x18,0x24,0x18, // o
	0x7c,0x24,0x18, // p
	0x18,0x24,0x7c, // q
	0x38,0x04,0x04, // r
	0x28,0x3c,0x14, // s
	0x04,0x3e,0x24, // t
	0x3c,0x20,0x3c, // u
	0x1c,0x20,0x1c, // v
	0x3c,0x30,0x3c, // w
	0x24,0x18,0x24, // x
	0x0c,0x50,0x3c, // y
	0x34,0x3c,0x2c, // z
	0x08,0x36,0x22, // {
	0x00,0x36,0x00, // |
	0x22,0x36,0x08, // }
	0x04,0x06,0x02, // ~
	0x3e,0x3e,0x3e, // DEL - full block
};

static const unsigned char BigFonts[]  = {
	0xF8,0xFE,0xFF,0x07,0x03,0x03,0x07,0xFF,0xFE,0xF8,0x0F,0x3F,0x7F,0x70,0x60,0x60,0x70,0x7F,0x3F,0x0F,
	0x00,0x10,0x18,0x1C,0xFE,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x7F,0x7F,0x00,0x00,0x00,
	0x0C,0x0E,0x0F,0x07,0x03,0x83,0xC7,0xFF,0xFE,0x7C,0x70,0x78,0x7C,0x7E,0x6F,0x67,0x63,0x61,0x60,0x60,
	0x0C,0x0E,0x0F,0xC7,0xC3,0xE7,0xFF,0xFE,0xBC,0x00,0x18,0x38,0x78,0x70,0x60,0x60,0x71,0x7F,0x3F,0x1F,
	0x00,0x80,0xC0,0xF0,0x78,0x1E,0xFF,0xFF,0xFF,0x00,0x0E,0x0F,0x0F,0x0D,0x0C,0x0C,0x7F,0x7F,0x7F,0x0C,
	0xF0,0xFF,0xFF,0x7F,0x63,0x63,0xE3,0xE3,0xC3,0x83,0x0C,0x3C,0x7C,0x70,0x60,0x60,0x70,0x7F,0x3F,0x1F,
	0xF8,0xFE,0xFF,0xC7,0xC3,0xC3,0xC7,0xCF,0x8E,0x0C,0x0F,0x3F,0x7F,0x71,0x60,0x60,0x71,0x7F,0x3F,0x1F,
	0x03,0x03,0x03,0x83,0xE3,0xFB,0x7F,0x1F,0x07,0x03,0x00,0x00,0x7C,0x7F,0x7F,0x03,0x00,0x00,0x00,0x00,
	0x1C,0x3E,0xFF,0xE7,0xC3,0xC3,0xE7,0xFF,0x3E,0x1C,0x1E,0x3F,0x7F,0x73,0x61,0x61,0x73,0x7F,0x3F,0x1E,
	0x7C,0xFE,0xFF,0xC7,0x83,0x83,0xC7,0xFF,0xFE,0xF8,0x18,0x38,0x79,0x71,0x61,0x61,0x71,0x7F,0x3F,0x0F
};


/*** The 8x6 hard coded font
 *
 * This font is always available
 *
 **/
static const unsigned char font8x6[354] = {
	0x00,0x00,0x00,0x00,0x00,0x00, 0x30,0x30,0x30,0x00,0x30,0x00,
	0xd8,0x90,0x00,0x00,0x00,0x00, 0x6c,0xfe,0x6c,0xfe,0x6c,0x00,
	0x7e,0xd0,0x7c,0x16,0xfc,0x00, 0xcc,0x18,0x30,0x60,0xcc,0x00,
	0x60,0x90,0x74,0xd8,0x6c,0x00, 0x30,0x20,0x00,0x00,0x00,0x00,
	0x60,0xc0,0xc0,0xc0,0x60,0x00, 0x18,0x0c,0x0c,0x0c,0x18,0x00,
	0x6c,0x38,0xfe,0x38,0x6c,0x00, 0x00,0x30,0xfc,0x30,0x00,0x00,
	0x00,0x00,0x00,0x30,0x20,0x00, 0x00,0x00,0x7c,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0xc0,0x00, 0x0c,0x18,0x30,0x60,0xc0,0x00,
	0x78,0x84,0x84,0x84,0x78,0x00, 0x04,0x0c,0x14,0x04,0x04,0x00,
	0x78,0x84,0x18,0x20,0x7c,0x00, 0x78,0x04,0x38,0x04,0x78,0x00,
	0x84,0x84,0xfc,0x04,0x04,0x00, 0xfc,0x80,0xf8,0x04,0xf8,0x00,
	0x30,0x40,0xf8,0x84,0x78,0x00, 0xfc,0x04,0x08,0x10,0x10,0x00,
	0x78,0x84,0x78,0x84,0x78,0x00, 0x78,0x84,0x7c,0x08,0x30,0x00,
	0x00,0x30,0x00,0x30,0x00,0x00, 0x00,0x30,0x00,0x30,0x20,0x00,
	0x30,0x60,0xc0,0x60,0x30,0x00, 0x00,0x7c,0x00,0x7c,0x00,0x00,
	0x30,0x18,0x0c,0x18,0x30,0x00, 0x78,0xcc,0x18,0x00,0x18,0x00,
	0x78,0xcc,0xdc,0xc0,0x7c,0x00, 0x30,0x48,0x84,0xfc,0x84,0x00,
	0xf8,0x84,0xf8,0x84,0xf8,0x00, 0x7c,0x80,0x80,0x80,0x7c,0x00,
	0xf8,0x84,0x84,0x84,0xf8,0x00, 0xfc,0x80,0xf0,0x80,0xfc,0x00,
	0xfc,0x80,0xf0,0x80,0x80,0x00, 0x7c,0x80,0x84,0x84,0x7c,0x00,
	0x84,0x84,0xfc,0x84,0x84,0x00, 0x10,0x10,0x10,0x10,0x10,0x00,
	0x04,0x04,0x04,0x84,0x78,0x00, 0x84,0x88,0xf0,0x88,0x84,0x00,
	0x80,0x80,0x80,0x80,0xfc,0x00, 0x82,0xc6,0xaa,0x92,0x82,0x00,
	0x84,0xc4,0xa4,0x94,0x8c,0x00, 0x78,0x84,0x84,0x84,0x78,0x00,
	0xf8,0x84,0xf8,0x80,0x80,0x00, 0x78,0x84,0x84,0x78,0x1c,0x00,
	0xf8,0x84,0xf8,0x90,0x88,0x00, 0x7c,0x80,0x78,0x04,0xf8,0x00,
	0xfe,0x10,0x10,0x10,0x10,0x00, 0x84,0x84,0x84,0x84,0x78,0x00,
	0x84,0x84,0x84,0x48,0x30,0x00, 0x82,0x82,0x92,0xaa,0x44,0x00,
	0x84,0x48,0x30,0x48,0x84,0x00, 0x88,0x88,0x50,0x20,0x20,0x00,
	0xf8,0x10,0x20,0x40,0xf8,0x00
};

/*** The 6x6 hard coded font
 *
 * This font is always available
 *
 **/
const unsigned char font6x6[] = {
	0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x00,0x80,0x00,0xA0,0xA0,0x00,0x00,
	0x00,0x00,0x50,0xF8,0x50,0xF8,0x50,0x00,0x70,0xA0,0x70,0x28,0x70,0x00,0xC8,0xD0,
	0x20,0x58,0x98,0x00,0x30,0x50,0x60,0x70,0x98,0xE0,0x80,0x80,0x00,0x00,0x00,0x00,
	0x40,0x80,0x80,0x80,0x40,0x00,0x80,0x40,0x40,0x40,0x80,0x00,0x50,0x20,0xF8,0x20,
	0x50,0x00,0x20,0x20,0xF8,0x20,0x20,0x00,0x00,0x00,0x00,0x40,0x40,0x80,0x00,0x00,
	0xF0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x00,0x08,0x10,0x20,0x40,0x80,0x00,
	0x60,0x90,0x90,0x90,0x60,0x00,0x40,0xC0,0x40,0x40,0xE0,0x00,0xE0,0x10,0x60,0x80,
	0xF0,0x00,0xE0,0x10,0x60,0x10,0xE0,0x00,0xA0,0xA0,0xE0,0x20,0x20,0x00,0xF0,0x80,
	0xF0,0x10,0xF0,0x00,0xF0,0x80,0xF0,0x90,0xF0,0x00,0xF0,0x10,0x20,0x40,0x40,0x00,
	0xF0,0x90,0xF0,0x90,0xF0,0x00,0xF0,0x90,0xF0,0x10,0x10,0x00,0x00,0x80,0x00,0x80,
	0x00,0x00,0x00,0x40,0x00,0x40,0x40,0x80,0x20,0x40,0x80,0x40,0x20,0x00,0x00,0xF0,
	0x00,0xF0,0x00,0x00,0x80,0x40,0x20,0x40,0x80,0x00,0xE0,0x20,0x60,0x00,0x40,0x00,
	0x70,0x88,0xB8,0xB8,0x80,0x78,0x60,0x90,0xF0,0x90,0x90,0x00,0xE0,0x90,0xE0,0x90,
	0xE0,0x00,0x70,0x80,0x80,0x80,0x70,0x00,0xE0,0x90,0x90,0x90,0xE0,0x00,0xF0,0x80,
	0xE0,0x80,0xF0,0x00,0xF0,0x80,0xE0,0x80,0x80,0x00,0xF0,0x80,0xB0,0x90,0xF0,0x00,
	0x90,0x90,0xF0,0x90,0x90,0x00,0xE0,0x40,0x40,0x40,0xE0,0x00,0x10,0x10,0x10,0x90,
	0x60,0x00,0x90,0xA0,0xC0,0xA0,0x90,0x00,0x80,0x80,0x80,0x80,0xF0,0x00,0x88,0xD8,
	0xA8,0x88,0x88,0x00,0x90,0xD0,0xB0,0x90,0x90,0x00,0x60,0x90,0x90,0x90,0x60,0x00,
	0xE0,0x90,0xE0,0x80,0x80,0x00,0x60,0x90,0x90,0xA0,0x50,0x00,0xE0,0x90,0xE0,0x90,
	0x90,0x00,0x70,0x80,0x60,0x10,0xE0,0x00,0xF8,0x20,0x20,0x20,0x20,0x00,0x90,0x90,
	0x90,0x90,0x60,0x00,0x90,0x90,0x90,0x60,0x60,0x00,0x88,0x88,0xA8,0xD8,0x88,0x00,
	0x90,0x90,0x60,0x90,0x90,0x00,0x88,0x88,0x50,0x20,0x20,0x00,0xF0,0x20,0x40,0x80,
	0xF0,0x00,0xC0,0x80,0x80,0x80,0xC0,0x00,0x80,0x40,0x20,0x10,0x08,0x00,0xC0,0x40,
	0x40,0x40,0xC0,0x00,0x20,0x50,0x88,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFC,0x00,
	0x40,0xA0,0x40,0x00,0x00,0x00,0x00,0x70,0x90,0x90,0x70,0x00,0x80,0xE0,0x90,0x90,
	0xE0,0x00,0x00,0x70,0x80,0x80,0x70,0x00,0x10,0x70,0x90,0x90,0x70,0x00,0x00,0x60,
	0xB0,0xC0,0x70,0x00,0x60,0x40,0xE0,0x40,0x40,0x00,0x00,0x70,0x90,0x70,0x10,0xE0,
	0x80,0xE0,0x90,0x90,0x90,0x00,0x80,0x00,0x80,0x80,0x80,0x00,0x20,0x00,0x20,0x20,
	0xA0,0x40,0x80,0x80,0xA0,0xC0,0xA0,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0xD0,
	0xA8,0xA8,0x88,0x00,0x00,0xE0,0x90,0x90,0x90,0x00,0x00,0x60,0x90,0x90,0x60,0x00,
	0x00,0xE0,0x90,0x90,0xE0,0x80,0x00,0x70,0x90,0x90,0x70,0x10,0x00,0xA0,0xD0,0x80,
	0x80,0x00,0x00,0x70,0xC0,0x30,0xE0,0x00,0x40,0xE0,0x40,0x40,0x40,0x00,0x00,0x90,
	0x90,0x90,0x60,0x00,0x00,0x90,0x90,0xA0,0x40,0x00,0x00,0x88,0xA8,0xA8,0xD8,0x00,
	0x00,0x90,0x60,0x60,0x90,0x00,0x00,0x90,0x90,0x70,0x10,0xE0,0x00,0xF0,0x20,0x40,
	0xF0,0x00,0x40,0x80,0x40,0x80,0x40,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x40,
	0x80,0x40,0x80,0x00,0x00,0x50,0xA0,0x00,0x00,0x00,0x20,0x50,0x88,0x88,0xF8,0x00,
	0x04,0x02,0x04,0x06,0x06,0x06,0x06,0x02,0x03,0x03,0x06,0x06,0x03,0x05,0x02,0x06,
	0x05,0x04,0x05,0x05,0x04,0x05,0x05,0x05,0x05,0x05,0x02,0x03,0x04,0x05,0x04,0x04,
	0x06,0x05,0x05,0x05,0x05,0x05,0x05,0x05,0x05,0x04,0x05,0x05,0x05,0x06,0x05,0x05,
	0x05,0x05,0x05,0x05,0x06,0x05,0x05,0x06,0x05,0x06,0x05,0x03,0x06,0x03,0x06,0x07,
	0x04,0x05,0x05,0x05,0x05,0x05,0x04,0x05,0x05,0x02,0x04,0x04,0x02,0x06,0x05,0x05,
	0x05,0x05,0x05,0x05,0x04,0x05,0x05,0x06,0x05,0x05,0x05,0x03,0x02,0x03,0x05,0x06
};

unsigned char testbit ( unsigned char mask, unsigned char bit )
{
	return mask & _BV ( bit ) ;
}

