glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/ssd1306.c
static void OLEDSpiInit ( void )
{
#if BOARD_REVISION == 3

	GPIO_InitTypeDef  GPIO_InitStructure;
	SPI_InitTypeDef   SPI_InitStructure;

#else

	LCD_SDIN_HIGH() ;
	LCD_SCLK_HIGH();

	DelayuS ( 50 );

#endif

#if BOARD_REVISION == 3

	/* Configure SPI1 pins: SCK, MISO */
	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA , ENABLE);
	//GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 ;
	//GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	//GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	//GPIO_Init(GPIOA, &GPIO_InitStructure);

	// Mode 0
	/* SPI1 Periph clock enable */
	RCC_APB2PeriphClockCmd ( RCC_APB2Periph_SPI1, ENABLE );
	SPI_I2S_DeInit ( SPI1 );
	SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Tx;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_128; // 72MHz/8 = 9MHz, /4 not use
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial = 7;
	SPI_Init ( SPI1, &SPI_InitStructure );

	/* SPI1 enable */
	SPI_Cmd ( SPI1, ENABLE );
#endif
}


static void OLEDSpiSendInstruction ( unsigned char byte )
{
#if BOARD_REVISION == 3
	// Set !CS , deselect DC
	GPIO_WriteBit ( OLED_CS_PORT, CS_PIN, Bit_RESET );
	GPIO_WriteBit ( OLED_PORT, DC_PIN, Bit_RESET );

	SPI_I2S_SendData ( SPI1, byte );

	while ( SPI_I2S_GetFlagStatus ( SPI1, SPI_I2S_FLAG_TXE ) == RESET );

	while ( !SPI_I2S_GetFlagStatus ( SPI1, SPI_I2S_FLAG_BSY ) == RESET );

	// Deselect !CS
	GPIO_WriteBit ( OLED_CS_PORT, CS_PIN, Bit_SET );
#endif

}

static void OLEDSpiSendByte ( unsigned char byte )
{
#if BOARD_REVISION == 3

	// Set !CS , select DC
	GPIO_WriteBit ( OLED_CS_PORT, CS_PIN, Bit_RESET );
	GPIO_WriteBit ( OLED_PORT, DC_PIN, Bit_SET );

	SPI_I2S_SendData ( SPI1, byte );

	while ( SPI_I2S_GetFlagStatus ( SPI1, SPI_I2S_FLAG_TXE ) == RESET );

	while ( !SPI_I2S_GetFlagStatus ( SPI1, SPI_I2S_FLAG_BSY ) == RESET );

	GPIO_WriteBit ( OLED_CS_PORT, CS_PIN, Bit_SET );


#else

	unsigned char  i ;
	unsigned char  tbyte = byte ;

	LCD_SCLK_HIGH( );

	for ( i = 0 ; i < 8 ; i++ ) {

		if ( tbyte & 0x80 ) {
			LCD_SDIN_HIGH() ;
		}

		else {
			LCD_SDIN_LOW() ;
		}

		LCD_SCLK_LOW() ;
		LCD_SCLK_HIGH( );

		tbyte  <<= 1;
	}

#endif
}

void InitOLED ( void )
{

	u8CursorX = 0;
	u8CursorY = 0;

	memset ( sVideoRAM,0,sizeof ( sVideoRAM ) );

	// Fill in the prefix command byte on each page line of the display buffer
	// We can do it during initialisation as this byte is never overwritten.

#ifdef SSD1306_PAGE_PREFIX
	{
		unsigned    i;

		for ( i=0; i < GDISP_SCREEN_HEIGHT/8 * SSD1306_PAGE_WIDTH; i+=SSD1306_PAGE_WIDTH )
		{ RAM ( g ) [i] = SSD1306_PAGE_PREFIX; }
	}
#endif
	DelaymS ( 500 );
	OLEDInit();

	OLEDClear();
	OLEDDraw();
}

void OLEDClear ( void )
{
	// Reset Cursor
	u8CursorX = 0;
	u8CursorY = 0;

	memset ( sVideoRAM,0,sizeof ( sVideoRAM ) );
}

/*-------------------------------------------------------------------------------
Send instruction to the LCD
    LcdInstructionWrite (uint8_t u8Instruction)
        u8Instruction = Instruction to send to the LCDCHSIZE 2 2469
-------------------------------------------------------------------------------*/
void LcdInstructionWrite ( unsigned char u8Instruction )
{
#if BOARD_REVISION == 3

	OLEDSpiSendInstruction ( u8Instruction ) ;

#else

	GPIO_WriteBit ( OLED_CS_PORT,CS_PIN,Bit_RESET );      // Select
	GPIO_WriteBit ( OLED_PORT,DC_PIN,Bit_RESET );          // Instruction mode

	OLEDSpiSendByte ( u8Instruction );

	while ( !SPI_I2S_GetFlagStatus ( SPI1, SPI_I2S_FLAG_BSY ) == RESET );

	// Chip not selected
	GPIO_WriteBit ( OLED_CS_PORT,CS_PIN,Bit_SET );
#endif

}

void InvertOLED ( unsigned char state )
{
	LcdInstructionWrite ( state?SSD1306_INVERTDISPLAY:SSD1306_NORMALDISPLAY );
}

void OLEDInit ( void )
{

	// Recommended power up sequence
	OLEDSpiInit();
	DelayuS ( 4 );
	GPIO_WriteBit ( OLED_PORT,RES_PIN,Bit_RESET );
	DelayuS ( 4 );

	GPIO_WriteBit ( OLED_PORT,RES_PIN,Bit_SET );
	DelayuS ( 4 );



	// Recommended initialization sequence
	LcdInstructionWrite ( LCD_DISP_OFF );
	LcdInstructionWrite ( LCD_SET_RATIO_OSC );
	LcdInstructionWrite ( 0x80 );
	LcdInstructionWrite ( LCD_MULTIPLEX );
	LcdInstructionWrite ( 0x3F );
	LcdInstructionWrite ( LCD_SET_OFFSET );
	LcdInstructionWrite ( 0x00 );
	LcdInstructionWrite ( LCD_SET_LINE );
	LcdInstructionWrite ( LCD_CHARGE_PUMP );
	LcdInstructionWrite ( LCD_PUMP_ON );

	//set at main LcdInstructionWrite(LCD_SET_SEG_REMAP1);
	//set at main LcdInstructionWrite(LCD_SET_SCAN_NOR);
	LcdInstructionWrite ( LCD_SET_PADS );
	LcdInstructionWrite ( 0x12 );
	LcdInstructionWrite ( LCD_SET_CONTRAST );
	LcdInstructionWrite ( 0xFF );
	LcdInstructionWrite ( LCD_SET_CHARGE );
	LcdInstructionWrite ( 0xF1 );
	LcdInstructionWrite ( LCD_SET_VCOM );
	LcdInstructionWrite ( 0x40 );
	LcdInstructionWrite ( LCD_EON_OFF );
	LcdInstructionWrite ( LCD_DISP_NOR );
	
	// horiz flip LCD_SET_SEG_REMAP0 / LCD_SET_SEG_REMAP1
	LcdInstructionWrite ( LCD_SET_SEG_REMAP0);
	
	// vertical flip LCD_SET_SCAN_NOR / LCD_SET_SCAN_FLIP
	LcdInstructionWrite ( LCD_SET_SCAN_FLIP );
	LcdInstructionWrite ( LCD_MEM_ADDRESSING );
	LcdInstructionWrite ( 0x00 );       // Horizontal Addressing mode
	LcdInstructionWrite ( LCD_DISP_ON );

	
}

void OLEDTest( void ) 
{
  	int y;

	
  	unsigned short test;
	unsigned short test2;
//  while( 1)
	{
		test2 = 40;


		while ( test2--  ) {

			test = 100;

			while ( test-- )  {

				OLEDSetPixel ( rand() %128,rand() %64,rand() %2 );
			}

			OLEDDraw();
			OLEDClear();
		}
	}
	DelaymS ( 500 );

	// Push cleared buffer
	OLEDDraw();


	OLEDPutstr ( "LAYERONE 2014 PROTOTYPE\n" );
	OLEDDraw();

	OLEDPutstr ( "OLED TEST\n" );
	OLEDDraw();

	for ( y = 0 ; y < 10 ; y++ ) {

		InvertOLED ( 1 );
		DelaymS ( 10*y );
		InvertOLED ( 0 );
		DelaymS ( 10*y );
	}

	OLEDPutstr ( "AUDIO TEST\n" );
	OLEDDraw();

	for ( y=0; y<400; y++ ) {
		SetSpeaker ( y * 100 );
	}

