glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/ssd1306.c
	while ( y-- ) {
		SetSpeaker ( y * 100 );
	}

	OLEDPutstr ( "LED TEST\n" );
	OLEDDraw();

	for ( y=0; y<20; y++ ) {

		LEDSet ( 1 );
		DelaymS ( 10*y );
		LEDSet ( 0 );
		DelaymS ( 10*y );
	}

	OLEDPutstr ( "RELAY TEST\n" );
	OLEDDraw();

	LEDSet ( 1 );
	HIGH ( RELAY );
	DelaymS ( 500 );

	LEDSet ( 0 );
	LOW ( RELAY );
	DelaymS ( 500 );

	LEDSet ( 1 );
	HIGH ( RELAY );
	DelaymS ( 500 );

	LEDSet ( 0 );
	LOW ( RELAY );
	DelaymS ( 700 );

	OLEDPutstr ( "DONE\n" );
	OLEDDraw();

}

void OLEDDraw ( void )
{
	unsigned short i;

	LcdInstructionWrite ( LCD_SET_COL_LO | 0x0 );
	LcdInstructionWrite ( LCD_SET_COL_HI | 0x0 );
	LcdInstructionWrite ( SSD1306_SETSTARTLINE | 0x0 );

	GPIO_WriteBit ( OLED_CS_PORT,CS_PIN,Bit_SET );    // Select
	GPIO_WriteBit ( OLED_PORT,DC_PIN,Bit_SET );           // Instruction mode
	GPIO_WriteBit ( OLED_CS_PORT,CS_PIN,Bit_RESET );  // Select

	for ( i=0; i< ( GDISP_SCREEN_WIDTH*GDISP_SCREEN_HEIGHT/8 ); i++ ) {
		OLEDSpiSendByte ( sVideoRAM[i] );
	}

	// i wonder why we have to do this (check datasheet)
	if ( GDISP_SCREEN_HEIGHT == 32 ) {
		for ( unsigned short i=0; i< ( GDISP_SCREEN_WIDTH*GDISP_SCREEN_HEIGHT/8 ); i++ ) {
			OLEDSpiSendByte ( 0 );

		}
	}

	// turn of !CS
	GPIO_WriteBit ( OLED_CS_PORT,CS_PIN,Bit_SET );
}

void OLEDSetPixel ( unsigned char x, unsigned char y, unsigned char color )
{
	if ( ( x >= GDISP_SCREEN_WIDTH ) || ( y >= GDISP_SCREEN_HEIGHT ) )
	{ return; }

	// HARDWARE DOES THIS
	//x = x - (GDISP_SCREEN_WIDTH-1);
	//y = (GDISP_SCREEN_HEIGHT-1) -  y;

	// x is which column
	if ( color )
	{ sVideoRAM[x+ ( y/8 ) *GDISP_SCREEN_WIDTH] |= _BV ( ( y%8 ) ); }

	else
	{ sVideoRAM[x+ ( y/8 ) *GDISP_SCREEN_WIDTH] &= ~_BV ( ( ( y%8 ) ) ); }
}

/**
 *     Plots a point (slow routine). 0,0 is the screen center instead of usual top left as 0,0
 *
 * @param x,y           - coordinates of point to plot
 * @param colour        - colour to use
 */
void    OLEDPixelQuad ( int x, int y, unsigned char colour )
{
	OLEDSetPixel ( x  ,y  , colour );
	OLEDSetPixel ( x+1,y  , colour );
	OLEDSetPixel ( x+1,y+1, colour );
	OLEDSetPixel ( x  ,y+1, colour );
}

void FlushOLED ( void )
{
}

// put byte on display buffer
// for this to flip properly, needs 7-y, width-x and data to be reversed
void write_display ( unsigned char data )
{
	sVideoRAM[ ( ( unsigned short ) ( ( u8CursorY ) <<7 ) ) + u8CursorX++] = data;
}

/*-------------------------------------------------------------------------------
    Print a char on the LCD
        OLEDBigchar (unsigned char u8Char)
            u8Char = char to display
-------------------------------------------------------------------------------*/
void OLEDBigchar ( unsigned char u8Char )
{

	unsigned char  i=0;
	uint16_t *pointer;

	if ( u8Char=='.' ) {        // Small point to Save space
		write_display ( 0x60 );
		write_display ( 0x60 );
		u8CursorX+=2;
	}

	else
		if ( u8Char=='-' ) {   // Negative sign
			write_display ( 0x03 );
			write_display ( 0x03 );
			write_display ( 0x03 );
			write_display ( 0x03 );
			u8CursorX+=2;
		}

		else
			if ( u8Char==' ' ) {   // Space
				u8CursorX+=6;
			}

			else {                      // Number

				pointer = ( uint16_t* ) BigFonts[u8Char*20];
				// Upper side
				u8CursorY--;

				while ( i < 10 ) {

					write_display ( *pointer ) ;
					pointer++ ;
					i++;
				}

				i=0;
				// Lower Side
				u8CursorY++;
				u8CursorX-=10;

				while ( i < 10 ) {
					write_display ( *pointer );
					pointer++;
					i++;
				}

				u8CursorX+=2;
			}
}

void OLEDPutchar ( char u8Char )
{
	uint8_t *pointer;
	uint8_t data,u8CharColumn=0;
	pointer = ( uint8_t* ) ( Fonts )+ ( u8Char-22 ) * ( 3 );

	/* Draw a char */
	while ( u8CharColumn < 3 )  {

		data = ( *pointer++ );

		if ( testbit ( Misc,NEGATIVE ) )
		{ data = ~ ( data|128 ); }

		write_display ( data );

		u8CharColumn++;
	}

	// Special characters
	if ( u8Char==0x1C ) {    // Begin long 'd' character
		write_display ( 0x30 );
	}

	else
		if ( u8Char==0x1D ) { // Complete long 'd' character
			write_display ( 0x38 );
			u8CursorX++;
		}

		else
			if ( u8Char==0x1A ) { // Complete long 'm' character
				write_display ( 0x08 );
			}

			else
				if ( u8CursorX < 128 ) { // if not then insert a space before next letter
					data = 0;

					if ( testbit ( Misc,NEGATIVE ) ) { data = 127; }

					write_display ( data );
				}

	if ( u8CursorX>=128 ) { // Next line
		u8CursorX = 0;
		u8CursorY++;
	}
}

void OLEDPutstr ( const char *ptr )
{
	char c;

	if ( u8CursorY > 6 )
	{ u8CursorY = 0 ; }

	while ( ( c=* ( ptr++ ) ) != 0x00 ) {
		if ( c == '\n' ) {
			u8CursorX = 0;
			u8CursorY++;
		}

		else
			if ( c == '\r' ) {
				u8CursorX = 0;
			}

			else  {
				OLEDPutchar ( c );
			}
	}
}

void OLEDPutBigstr ( const char *ptr )
{
	char c;

	while ( ( c=* ( ptr++ ) ) != 0x00 ) {
		if ( c == '\n' ) {
			u8CursorX = 0;
			u8CursorY++;
		}

		else
			if ( c == '\r' ) {
				u8CursorX = 0;
			}

			else  {
				OLEDBigchar ( c );
			}
	}
}

/*-------------------------------------------------------------------------------
Send an image to the LCD
    OLEDDisplayPicture (uint8_t *au8PictureData)
        au8PictureData = contains encoded data for picture

    Decode:
    Get one byte, put it to the output file, and now it's the 'last' byte.
    Loop
    Get one byte
    Is the current byte equal to last?
    Yes
        Now get another byte, this is 'counter'
        Put current byte in the output file
        Copy 'counter' times the 'last' byte to the output file
        Put last copied byte in 'last' (or leave it alone)
    No
        Put current byte to the output file
        Now 'last' is the current byte
    Repeat.
-------------------------------------------------------------------------------*/
void OLEDDisplayPicture ( const uint8_t *pointer )
{
	uint8_t data=0, count=0;
	uint16_t i;
	uint8_t *p;

