glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/ssd1306.c
	p = sVideoRAM;

	for ( i = 0; i < 1024; i++ ) {
		if ( count==0 ) {
			data = * ( pointer++ );

			if ( data==* ( pointer++ ) ) {
				count = * ( pointer++ );
			}

			else {
				count = 1;
				pointer--;
			}
		}

		count--;
		*p++ = data;
	}
}

void OLEDDrawXY ( int x,int y )
{

}

// Graphs
unsigned char graphx[ GDISP_SCREEN_WIDTH ] ;

void OLEDDrawGraph ( void )
{
	int x;

	for (  x =0 ; x < GDISP_SCREEN_WIDTH ; x ++ ) {

		OLEDSetPixel ( x,graphx[x],1 );
	}
}

void OLEDSetCursor ( int x,int y )
{
	u8CursorX = x;
	u8CursorY = y;
}

/**
 * Compute outcodes for clipper.
 */
static int BuildOutcodes ( int x, int y )
{
	register int code = 0;

	if ( y >= m_clip_y_max )
	{ code |= 1; }        // top

	else
		if ( y < m_clip_y_min ) { code |= 2; } // bottom

	if ( x >= m_clip_x_max ) { code |= 4; }     // right

	else
		if ( x < m_clip_x_min ) { code |= 8; } // left

	return ( code );
}

char clipLine ( int x1, int y1, int x2, int y2,
                int *x3, int *y3, int *x4, int *y4 )
{
	int code1, code2, codeout;
	bool accept = false, done = false ;

	//the region outcodes for the endpoints
	code1 = BuildOutcodes ( x1, y1 );
	code2 = BuildOutcodes ( x2, y2 );

//In theory, this can never end up in an infinite loop, it'll always come in one of the trivial cases eventually
	do {
		//accept because both endpoints are in screen or on the border, trivial accept
		if ( ! ( code1 | code2 ) ) {
			accept = done = 1;
		}

		else
			if ( code1 & code2 ) {
				//the line isn't visible on screen, trivial reject
				done = 1;
				//if no trivial reject or accept, continue the loop
			}

			else  {

				int x, y;

				codeout = code1 ? code1 : code2;

				if ( codeout & 1 ) { //top
					x = x1 + ( x2 - x1 ) * ( m_clip_y_max - y1 ) / ( y2 - y1 );
					y = m_clip_y_max - 1;
				}

				else
					if ( codeout & 2 ) { //bottom
						x = x1 + ( x2 - x1 ) * -y1 / ( y2 - y1 );
						y = 0;
					}

					else
						if ( codeout & 4 ) { //right
							y = y1 + ( y2 - y1 ) * ( m_clip_x_max - x1 ) / ( x2 - x1 );
							x = m_clip_x_max - 1;
						}

						else { //left
							y = y1 + ( y2 - y1 ) * -x1 / ( x2 - x1 );
							x = 0;
						}

				if ( codeout == code1 ) { //first endpoint was clipped
					x1 = x;
					y1 = y;
					code1 = BuildOutcodes ( x1, y1 );
				}

				else { //second endpoint was clipped
					x2 = x;
					y2 = y;
					code2 = BuildOutcodes ( x2, y2 );
				}
			}
	}
	while ( done == 0 );

	if ( accept ) {

		*x3 = x1;
		*x4 = x2;
		*y3 = y1;
		*y4 = y2;

		return 1;

	}

	else {

		x3 = x4 = y3 = y4 = 0;

		return 0;
	}
}


void OLEDLine ( int x0, int y0, int x1, int y1,int col )
{
	int step = abs ( y1 - y0 ) > abs ( x1 - x0 ) ;
	int t;

	if ( step ) {
		t = x0;
		x0 = y0;
		y0 = t;
		t = x1;
		x1 = y1;
		y1 = t;
	}

	if ( x0 > x1 ) {
		t = x0;
		x0 = x1;
		x1 = t;
		t = y0;
		y0 = y1;
		y1 = t;
	}

	int dx, dy;

	dx = x1 - x0;
	dy = abs ( y1 - y0 );

	int err = dx / 2;
	int ystep;

	if ( y0 < y1 ) {
		ystep = 1;
	}

	else {
		ystep = -1;
	}

	for ( ; x0<x1; x0++ ) {
		if ( step ) {
			OLEDSetPixel ( y0, x0,col );
		}

		else {
			OLEDSetPixel ( x0, y0,col );
		}

		err -= dy;

		if ( err < 0 ) {
			y0 += ystep;
			err += dx;
		}
	}
}

/**
 * Draw an 8 bit string using the builtin 8x6 font (this font is always available)  possibly using transparency
 *
 * @param x     - X position on screen, will be clipped.
 * @param y     - Y position on screen, will be clipped.
 * @param string- 8 bit ASCIZ string
 * @param f_colour - foreground colour to use 0/1
 * @param b_colour - background colour to use 0/1
 */
void OLEDText8x6 ( short x,short y,const char *string,unsigned char f_colour, unsigned char b_colour )
{
	short nm,i,j,oldx=x;
	unsigned char  cur;
	int l_adr;
	int l=0;

	if ( x == -1 ) {
		// center it
		x =  ( ( SCREEN_WIDTH/2 )- ( ( strlen ( string ) * 7 ) /2 ) );
	}

	while ( *string!='\0' ) {                                 /* until the end of the string */
		if ( *string=='\n' ) {
			x=oldx;
			y+=7;
			l=0;
			string++;
		}

		nm= ( ( *string++ )-' ' );                              /* Starting from space */

		if ( nm > 58 )
		{ nm-=' '; }                                          /* to uppercase 58='Z'-' ' */

		nm *= 6;                                            /* 6 bytes per char */

		for ( i=0,l_adr=0; i<6; i++,l_adr++ ) {
			cur=font8x6[nm++];

			for ( j=0; j<8; j++ ) {
				if ( cur& ( 0x80>>j ) ) {
					OLEDSetPixel ( x+j+l,y+i,f_colour );
				}

				else {
					// if both colours match make it transparent
					if ( f_colour != b_colour ) {
						OLEDSetPixel ( x+j+l,y+i,b_colour );
					}
				}
			}
		}

		//adr+=7;
		l+=7;/* Next word */
	}
}

/**
 * Draw an 8 bit string using the builtin 6x6 font (this font is always available)  possibly using transparency
 *
 * @param x     - X position on screen, will be clipped.
 * @param y     - Y position on screen, will be clipped.
 * @param string- 8 bit ASCIZ string
 * @param f_colour - foreground colour to use
 * @param b_colour - background colour to use (if fore and back same colour, draw transparent)
 */
void OLEDText6x6 ( short x,short y,const char *string,char f_colour,char b_colour )
{
	short nm,i,j,oldx=x;
	unsigned char  cur;
	int l = 0;


	while ( *string!='\0' ) {                                   /* until the end of the string */

		if ( *string=='\n' ) {
			x=oldx;
			y+=6;
			string++;
		}

		else {

			nm= ( ( *string++ )-' ' );                /* Starting from space */

			if ( nm>58 ) { nm-=' '; }                     /* to uppercase 58='Z'-' ' */

			nm*=6;                                    /* 6 bytes per char */

			for ( i=0; i<6; i++ ) {
				cur=font6x6[nm++];

				for ( j=0; j<6; j++ ) {
					if ( cur& ( 0x80>>j ) ) {
						OLEDSetPixel ( x+j+l,y+i,f_colour );
					}

					else {
						/* if both colours match make it transparent */
						if ( f_colour != b_colour ) {
							OLEDSetPixel ( x+j+l,y+i,b_colour );
						}
					}
				}
			}

			l+=5;                                   /* Next word */
		}
	}
}

/**
 *   Draw a horizontal line
 *
 * @param colour - colour
 * @param x       - x position
 * @param length      - line length
 * @param y       - y position
 *
 */
void OLEDFlatLine ( unsigned char colour,short x,unsigned short length,int y )
{
	unsigned short i;

	for ( i = 0 ; i < length ; i++ ) {
		OLEDSetPixel ( x+i, y, colour );
	}
}

/**
 *  Draw a filled solid colour rectangle
 *
 * @param us_colour - colour
 * @param x      - x position
 * @param y      - y position
 * @param width  - rect width
 * @param height - rect height
 *
 */
void OLEDFilledRect ( unsigned char colour, int x,int y, unsigned int width,unsigned int height )
{
	unsigned int i;
	int diff;
	int w,h;

	// if completely offscreen
	if ( ( signed ) ( x + width ) < 0  ) {
		return;
	}

	if ( ( signed ) ( y + height ) < 0  ) {
		return;
	}

	// Calculate width from base
	if ( x < 0 ) {
		diff = 0 -x ;

		width = w  = width  - diff;

		if ( w < 1 )
		{ return ; }

