glocklueng/032/LayerOne_2014/badge/stm32-prox/rev4/stm32f34-charliex-lost-his-mind/stm32f4-proxmark3/ssd1306.c
		x = 0;
	}

	if ( y < 0 ) {
		diff = 0 - y ;

		height = h  = height - diff;

		if ( h< 1 )
		{ return; }

		y = 0;
	}

	height = MIN ( ( height+y ),m_clip_y_max-1 );


	for ( int j=y; j<height; j++ ) {
		for ( i = 0 ; i < width ; i++ ) {

			OLEDSetPixel ( x+i, j, colour );
		}
	}
}


/**
 *  Draw an outlined single colour rectangle as a frame
 *
 * @param colour    - colour
 * @param x      - x position
 * @param y      - y position
 * @param width  - frame rect width
 * @param height     - frame rect height
 *
 */
void OLEDOutlineRect ( unsigned char colour, int x,int y, int width,int height )
{
	int i;

	if ( height <1 )
	{ return ; }

	if ( width <1 )
	{ return ; }

	OLEDFlatLine ( colour,x,width,y );

	for ( i=y+1; i<y+ ( height-1 ); i++ ) {
		OLEDSetPixel ( x,i,colour );
		OLEDSetPixel ( x+ ( width-1 ),i,colour );
	}

	OLEDFlatLine ( colour,x,width,y+ ( height-1 ) );
}

#define fill_circle(x,y,c) x1 = xc - x; x2 = xc + x; OLEDFlatLine(c,x1,x2-x1,y);


/**
 *  Draw a filled single colour circle
 *
 * @param colour    - colour
 * @param xc        - x centre position
 * @param yc        - y centre position
 * @param radius    - radius of circle
 * @param c         - RGB colour
 *
 */

void DrawCircle ( int xc,int yc, unsigned int radius , unsigned char c )
{
	int x, y, p;
	int x1,x2;

	if ( radius < 1 ) {
		return;
	}

	x = 0;
	y = radius;
	p = 3-2*radius;

	while ( x <= y ) {

		fill_circle ( x,yc+y,c );
		fill_circle ( x,yc-y,c );
		fill_circle ( y,yc+x,c );
		fill_circle ( y,yc-x,c );

		if ( p < 0 ) {
			p = p + 4 * x + 6;
		}

		else {
			p = p + 4 * ( x - y ) + 10;
			y --;
		}

		x++;
	}
}
#define fill_circlea(x,y,c) x1 = xc - x; x2 = xc + x; OLEDFlatLine(c,x1,x2-x1,y);


/**
 *  Draw a filled single colour circle
 *
 * @param colour    - colour
 * @param xc        - x centre position
 * @param yc        - y centre position
 * @param radius    - radius of circle
 * @param c         - RGB colour
 *
 */

void OLEDDrawCircle ( int xc,int yc, unsigned int radius , unsigned char c )
{
	int x, y, p;
	int x1,x2;

	if ( radius < 1 ) {
		return;
	}

	x = 0;
	y = radius;
	p = 3-2*radius;

	while ( x <= y ) {

		fill_circlea ( x,yc+y,c );
		fill_circlea ( x,yc-y,c );
		fill_circlea ( y,yc+x,c );
		fill_circlea ( y,yc-x,c );

		if ( p < 0 ) {
			p = p + 4 * x + 6;
		}

		else {
			p = p + 4 * ( x - y ) + 10;
			y --;
		}

		x++;
	}
}
/**
 *  Draw an outlined single colour circle
 *
 * @param colour    - colour
 * @param xc        - x centre position
 * @param yc        - y centre position
 * @param radius    - radius of circle
 * @param c         - RGB colour
 *
 */
void OLEDDrawOutlineCircle ( int xc,int yc, unsigned int radius , unsigned char c )
{
	int x, y, p;

	if ( !radius ) {
		return;
	}

	x = 0;
	y = radius;
	p = 3 - 2 * radius;

	while ( x <= y ) {

		OLEDSetPixel ( xc+x,yc+y,c );
		OLEDSetPixel ( xc-x,yc+y,c );
		OLEDSetPixel ( xc+x,yc-y,c );
		OLEDSetPixel ( xc-x,yc-y,c );
		OLEDSetPixel ( xc+y,yc+x,c );
		OLEDSetPixel ( xc-y,yc+x,c );
		OLEDSetPixel ( xc+y,yc-x,c );
		OLEDSetPixel ( xc-y,yc-x,c );

		if ( p < 0 ) {
			p = p + 4 * x + 6;
		}

		else {
			p = p + 4 * ( x - y ) + 10;
			y --;
		}

		x++;
	}
}
